Repository: Mary-Clb/doc
Catalog: source/locale/*/LC_MESSAGES/news/index.po
Languages: cs_cz

source: News
cs_cz: Upozornění

source: Sources link: https://github.com/pluginsGLPI/news
cs_cz: Zdrojový odkaz: https://github.com/pluginsGLPI/news

source: Download: https://github.com/pluginsGLPI/news/releases
cs_cz: Stáhnout: https://github.com/pluginsGLPI/news/releases

source: Requirements for latest version
cs_cz: Požadavky pro poslední verzi

source: This plugin requires :
cs_cz: Tento zásuvný modul vyžaduje :

source: PHP 7.2 or higher
cs_cz: PHP 7.2 nebo vyšší

source: Features
cs_cz: Funkce

source: This plugin allows to display alerts messages on GLPI homepage and / or login page.
cs_cz: Tento zásuvný modul umožňuje zobrazit upozornění na domovské stránce GLPI a/nebo na přihlašovací stránce.

source: Create alert with rich text as for notes.
cs_cz: Vytvoření upozornění s formátovaným textem jako u poznámek.

source: Choice of begin/end publication date.
cs_cz: Výběr datum počátku/konce zobrazení.

source: Manage alerts by entity.
cs_cz: Spravovat upozornění dle entity.

source: Target : display alerts by profile / group / user.
cs_cz: Cíl: zobrazit upozornění dle profilu / skupiny / uživatele.

source: Install the Plugin
cs_cz: Instalovat zásuvný modul

source: Uncompress the archive.
cs_cz: Rozbalit archiv.

source: Move the ``news`` directory to the ``<GLPI_ROOT>/plugins`` directory
cs_cz: Přesun adresáře ``news`` do adresáře ``<GLPI_ROOT>/plugins``

source: Navigate to the *Configuration > Plugins* page,
cs_cz: Přejděte na stránku *Nastavení > Zásuvné moduly*,

source: Install and activate the plugin.
cs_cz: Instalovat a aktivovat zásuvný modul.

source: Usage
cs_cz: Použití

source: The plugin will create required tables in the database automatically. Those tables will be updated along with the plugin.
cs_cz: Zásuvný modul automaticky vytvoří požadované tabulky v databázi. Tyto tabulky budou aktualizovány spolu se zásuvným modulem.

source: Plugin usage is quite simple:
cs_cz: Použití zásuvného modulu je velmi jednoduché:

source: configure alerts
cs_cz: nastavení upozornění

source: You will access the plugin configuration from the *Tools* > *Alerts*.
cs_cz: Ke konfiguraci zásuvného modulu se dostanete z menu * Nástroje *> * Upozornění *.

source: Create alerts
cs_cz: Vytvořit upozornění

source: Name : display as talert title
cs_cz: Jméno: zobrazí se jako titulek upozornění

source: Active : is active or not
cs_cz: Aktivní: ano nebo ne

source: Description : content of alert
cs_cz: Popis: obsah upozornění

source: Visibility start / end : period of Visibility
cs_cz: Začátek/konec viditelnosti: doba viditelnosti

source: Type : type of alert (General, Information, Warning, Problem)
cs_cz: Typ: typ upozornění (Obecné, Informace, Varování, Problém)

source: Can close alert : User can close alert ?
cs_cz: Je možné uzavřít upozornění: Může uživatel zavřít upozornění ?

source: Show on login page : display or not alert on login page
cs_cz: Zobrazit na přihlašovací stránce: zobrazení na přihlašovací stránce ano /ne

source: Show on helpdesk page : display or not alert on helpdesk page
cs_cz: Zobrazení na stránce helpdesku: Zobrazit na stránce helpdesku ano/ne

source: Sub-entity : display or not on sub-entity
cs_cz: Podřízené entity: Zobrazit podřízené entity ano/ne

source: Targets
cs_cz: Cíle

source: You can define target by type
cs_cz: Můžete definovat cíl dle typu

source: Group : for all users of group
cs_cz: Skupina: pro všechny uživatele ve skupině

source: Profil : for all users with profile
cs_cz: Profil: pro všechny uživatele v daném profilu

source: User : for specifi user
cs_cz: Uživatel: pro specifického uživatele

source: Display on login page
cs_cz: Zobrazit na přihlašovací stránce

source: Display on helpdesk page
cs_cz: Zobrazit na stránce helpdesku
