Repository: Mary-Clb/doc
Catalog: source/locale/*/LC_MESSAGES/oauthimap/index.po
Languages: fr_fr

source: Sources link: https://github.com/pluginsGLPI/oauthimap
fr_fr: Code source : https://github.com/pluginsGLPI/oauthimap

source: Download: https://github.com/pluginsGLPI/oauthimap/releases
fr_fr: Téléchargement : https://github.com/pluginsGLPI/oauthimap/releases

source: Features
fr_fr: Fonctionnalités

source: This plugin supports Oauth connection for emails receivers.
fr_fr: Ce plugin permet la connexion Oauth pour les collecteurs mail.

source: Supported mail services:
fr_fr: Services de mail supportés :

source: `G Suite and Gmail <https://developers.google.com/gmail/imap/xoauth2-protocol>`_,
fr_fr: `G Suite et Gmail <https://developers.google.com/gmail/imap/xoauth2-protocol>`_,

source: Install the Plugin
fr_fr: Installer le plugin

source: Plugin is available inside GLPI marketplace.
fr_fr: Le plugin est disponible au sein du marketplace de GLPI.

source: You can also install it manually:
fr_fr: Vous pouvez aussi l'installer manuellement :

source: Uncompress the archive.
fr_fr: Décompressez l'archive.

source: Move the ``oauthimap`` directory to the ``<GLPI_ROOT>/plugins`` directory.
fr_fr: Déplacez le dossier ``oauthimap`` dans le dossier ``<GLPI_ROOT>/plugins``.

source: Navigate to the *Setup > Plugins* page.
fr_fr: Naviguez vers la page *Configuration > Plugins*.

source: Install and activate the plugin.
fr_fr: Installez et activez le plugin.

source: Configure your Oauth IMAP application
fr_fr: Configurer votre Application Oauth IMAP

source: To be able to connect to a mailbox using Oauth authentication, you first need to configure your *Oauth IMAP application*:
fr_fr: Pour pouvoir établir une connexion à une boîte mail en utilisant l'authentification Oauth, vous devez au préalable configurer votre *Application Oauth IMAP*:

source: Register an external application on service provider management console;
fr_fr: Enregistrez votre application externe sur la console de gestion du fournisseur de service;

source: Create an item in *Setup > Oauth IMAP applications* using *id* and *secret* of your provider application;
fr_fr: Créez un élément dans *Configuration > Applications Oauth IMAP* en utilisant les champs *id* et *secret* de l'application du fournisseur de service;

source: Copy callback url from the Oauth IMAP application configuration and fill it in the provider console (GLPI will be called back after authentication process).
fr_fr: Copiez l'URL de retour depuis la page de configuration de l'Application Oauth IMAP et saisissez là dans la console du fournisseur de service (GLPI sera appelé à la fin du processus d'authentification).

source: Create an authorization
fr_fr: Créer une autorisation

source: Once your Oauth IMAP application created, you will need to create an authorization that will be used to authenticate on your mailbox. To do so, go in the *Oauth authorization* tab of your Oauth IMAP application, and click on *Create an authorization*.
fr_fr: Une fois votre Application Oauth IMAP créée, yous devrez créer une autorisation qui sera utilisée lors de l'authentification à votre boîte mail. Pour se faire, allez dans l'onglet *Authorisation Oauth* de votre Application Oauth IMAP, et cliquez sur *Créer une autorisation*.

source: You can create an authorization for each of the mailboxes you want to use in mail receivers. When you create an authorization for a mailbox, previously existing authorizations for this mailbox are discarded.
fr_fr: Vous pouvez créer une autorisation pour chacune des boîtes mail que vous souhaitez utiliser dans des collecteurs mail. Quand vous créez une autorisation pour une boîte mail, toute autorisation existante pour cette même boîte est défaussée.

source: Configure your mail receiver
fr_fr: Configurer votre collecteur mail

source: To authenticate via Oauth on your mail receiver, you have to change the configuration of your mail receiver:
fr_fr: Pour s'authentifier via Oauth à votre collecteur mail, vous devez changer la configuration de celui-ci :

source: choose your Oauth IMAP application in the first dropdown of *Connection options*;
fr_fr: choisissez vote Application Oauth IMAP dans la première liste déroulant des *Options de connexion*;

source: then choose an existing authorization in the *Login* dropdown or select *Create authorization for another user*.
fr_fr: puis choisissez une autorisation existant dans la liste déroulante *Identifiant* ou choisissez *Créer une autorisation pour un autre utilisateur*.
