Repository: Mary-Clb/doc
Catalog: source/locale/*/LC_MESSAGES/credit/index.po
Languages: cs_cz, ko_kr

source: Credit
cs_cz: Kredit
ko_kr: 크레딧

source: Sources link: https://github.com/pluginsGLPI/credit
cs_cz: Zdrojový odkaz: https://github.com/pluginsGLPI/credit
ko_kr: 원본 링크: https://github.com/pluginsGLPI/credit

source: Download: https://github.com/pluginsGLPI/credit/releases
cs_cz: Stáhnout: https://github.com/pluginsGLPI/credit/releases
ko_kr: 다운로드: https://github.com/pluginsGLPI/credit/releases

source: Requirements for latest version
cs_cz: Požadavky pro poslední verzi
ko_kr: 최신판에 대한 요구사항

source: This plugin requires :
cs_cz: Tento zásuvný modul vyžaduje :
ko_kr: 이 플러그인 필수사항:

source: PHP 7.2 or higher
cs_cz: PHP 7.2 nebo vyšší
ko_kr: PHP 7.2 이상

source: Features
cs_cz: Funkce
ko_kr: 특징

source: This plugin allows you to declare and follow (by entity) the consumptions of different credit vouchers directly from the Ticket form.
cs_cz: Tento zásuvný modul umožňuje deklarovat a sledovat (podle entity) spotřeby různých kreditních poukázek přímo z formuláře Požadavku.
ko_kr: 이 플러그인은 티켓 양식에서 다른 직접 크레딧 바우처의 소비를 선언하고 (개체별로) 추적하게 해줍니다.

source: To do it, you must follow these steps:
cs_cz: Chcete-li to provést, musíte postupovat takto:
ko_kr: 실행하려면, 다음 단계들을 따르세요:

source: Creation of different types of credit vouchers (as GLPI dropdown);
cs_cz: Vytvoření různých typů kreditních poukázek (jako rozbalovací nabídka GLPI);
ko_kr: (GLPI 드롭다운) 크레딧 바우처의 다른 유형들 생성;

source: Creation, in Entity tab, of the credit vouchers available for these entities;
cs_cz: Vytvoření kreditních poukázek dostupných na těchto entitách v tabulce Entity;
ko_kr: 개체 탭에서, 이 개체들에 대한 사용 가능한 크레딧 바우쳐 생성;

source: Declaration / Modification / Deletion of a consumption in the Ticket form and tab;
cs_cz: Deklarace / úprava / vymazání spotřeby ve formuláři a kartě Požadavek;
ko_kr: 티켓 양식과 탭에서 소비의 선언 / 수정 / 삭제;

source: Consultation of the vouchers sold, the remaining credits, credits consumptions from the Ticket form or from Entity tab.
cs_cz: Konzultace o prodaných poukázkách, zbývajících kreditech, spotřebě kreditů z formuláře Požadavek nebo z karty Entity.
ko_kr: 판매된 바우처, 잔여 크레딧, 티켓 양식 또는 개체 탭에서의 크레딧 소비에 대한 상담

source: Configuration
cs_cz: Nastavení
ko_kr: 구성

source: The plugin will create required tables in the database automatically. Those tables will be updated along with the plugin.
cs_cz: Zásuvný modul automaticky vytvoří požadované tabulky v databázi. Tyto tabulky budou aktualizovány spolu se zásuvným modulem.
ko_kr: 플러그인은 자동으로 데이터베이스에 필수 테이블을 생성하게됩니다. 해당 테이블들은 플러그인과 함께 갱신되게 됩니다.

source: Plugin usage is quite simple:
cs_cz: Použití zásuvného modulu je velmi jednoduché:
ko_kr: 플러그인 사용법은 아주 간단합니다:

source: You will access the credit configuration from the *Administration* > *Entities*.
cs_cz: Ke konfiguraci zásuvného modulu se dostanete z menu *Správa*> *Entity *.
ko_kr: *관리자* > *개체* 에서 크레딧 구성에 접근하게 됩니다.

source: Name : add name to credit
cs_cz: Název: přidat název kreditu
ko_kr: 이름 : 크레딧에 이름 추가

source: Type : Define a type
cs_cz: Typ: definice typu
ko_kr: 유형 : 유형 정의

source: Start / End date : Define duration of credit
cs_cz: Počáteční / konečné datum: definovat trvání kreditu
ko_kr: 시작 / 종료 일자 : 크레딧의 기간 정의

source: Active : Display credit on ticket form or not
cs_cz: Aktivní: Zobrazit kredit ve formuláři požadavku ano/ne
ko_kr: 활성화 : 티켓 양식에 크레딧 표시 유무

source: Quantity : quantity spend
cs_cz: Množství: vynaložené množství
ko_kr: 수량 : 소비 수량

source: Allow overconsumption : allow or not over consumptin (if yes, check is bypass)
cs_cz: Povolit přečerpání: povolit nebo nepovolit nadměrnou spotřebu (pokud ano, kontrola je vynechána)
ko_kr: 초과 소비 허용 : 초과 소비 허용 유무 (예 이면, 확인은 건너뜀)

source: Credit consumption
cs_cz: Čerpání kreditu
ko_kr: 크레딧 소비

source: When you solved a ticket, solution form have field to to consume credit
cs_cz: Pokud vyřešíte požadavek, formulář řešení má pole pro spotřebu kreditu
ko_kr: 티켓을 해결 시, 솔루션 양식에서 크레딧을 소비할 항목

source: Credit report
cs_cz: Report kreditu
ko_kr: 크레딧 보고서

source: On the ticket form, click on the *Credit* tab to view a report on credit consumption
cs_cz: Na formuláři požadavku klikněte na tlačítko "Kredit" pro zobrazení reportu o čerpání kreditu
ko_kr: 티켓 양식에서, 크레딧 소비에 대한 보고서를 보려면 *Credit* 탭을 클릭하세요
